{
  "title": "On the Count of Three",
  "review_date": "2022-08-21",
  "release_year": "2021",
  "director": "Jerrod Carmichael",
  "starring": "Jerrod Carmichael and Christopher Abbott",
  "review_rating": "8",
  "reviewer": "Patrick Russo",
  "review": "Jerrod Carmichael’s vanta-black comedy is a must watch for viewers who want a full-bodied film with heart wrenching compassion and smart laughs. On the Count of Three delivers on all fronts: outstanding performances from Carmichael and Christopher Abbott, witty dialogue, and melancholy cinematography.\n\nCan we take a moment to appreciate the length of this movie? There are so many 2 ½ hour long movies that have only half the amount of depth that Ari Katcher and Ryan Welch’s screenplay provides. In 86 minutes you will laugh, cry, get angry, do who knows what else.\n\nThe film follows Val, who upon deciding to commit suicide, breaks his lifelong, mentally troubled friend, Kevin, out of a psych ward to commit suicide together. After initial hesitation, the duo decides to postpone their deaths until later that day, and spend the time closing loose ends in their lives. Despite what you might expect from a dark comedy about two friends who decide to kill each other in a rash suicide pact, Carmichael handles the topic with immense care. The gravity of suicide in On the Count of Three is intitially ignored in the opening sequences, but the weight grows heavy as the two reconcile with their past. The film succeeds in examining the moral implications of suicide through Val and Kevins’ unwavering friendship, elevating it past just another buddy comedy.\n\nThere is a natural rhythm between Carmichael and Abbott. The pair compliment each other's personalities, convincing the viewer that these two really did grow up together in a semi-rural northeastern wasteland. It’s easy to get lost in the ebb and flow of their thought process of how they should spend their last day on Earth. From dirtbike races to exacting revenge, there is something unexpected around every corner.\n\nOn the Count of Three is one of the most heavy hitting narratives of the year, and came out of absolutely nowhere. All we can do now is thank Jarrod Carmichael and eagerly await his next feature length project.\n"
}
